app/controllers/heroes_controller.rb

SELECT "heroes".* FROM "heroes"
---
    def index
        heroes = Heroe.all

SELECT "heroes".* FROM "heroes" WHERE "heroes"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def show
        heroe = Heroe.find(params[:id])