app/controllers/heroe_powers_controller.rb

    def create
        heroe_power =HeroePower.create(heroe_power_params)
---
INSERT INTO "heroe_powers" ("strength", "power_id", "heroe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["strength", 1], ["power_id", 3], ["heroe_id", 5], ["created_at", "2023-03-24 11:55:23.365869"], ["updated_at", "2023-03-24 11:55:23.365869"]]