app/controllers/powers_controller.rb

    def show
        power = Power.find(params[:id])
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        power = Power.find(params[:id]).update(power_params)
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "powers" SET "description" = ?, "updated_at" = ? WHERE "powers"."id" = ?